eisup_2019_docmng_integration/src/Reports/абс_ОтчетПоДокументуРПР/абс_ОтчетПоДокументуРПР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>абс_ОтчетПоДокументуРПР</name>
  <attributes>
    <name>УниверсальныйОтчет</name>
    <type>
      <types>ReportObject.УниверсальныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРПР</name>
    <type>
      <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
    </type>
  </attributes>
</mdclass:Report>

eisup_2019_docmng_integration/src/Documents/абс_РезервыПроизведенныхРасходов/абс_РезервыПроизведенныхРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РезервыПроизведенныхРасходов</name>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоБУ</registerRecords>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоНУ</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <registerRecords>InformationRegister.абс_НачислениеРНПД</registerRecords>
  <registerRecords>AccumulationRegister.КонтролируемыеЗначенияБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.абс_ГрафикПоставкиЗакупочногоЗаказа</registerRecords>
  <registerRecords>AccumulationRegister.абс_ЗатратыПоДоговорамСКонтролемЛимитов</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыДокументовРНПД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Дирекция</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыРПР</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБухгалтер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПодразделения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Резервы</name>
    <attributes>
      <name>Учитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДоговора</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупочныйЗаказ</name>
      <type>
        <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      </type>
    </attributes>
    <attributes>
      <name>БюджетнаяСтатья</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОстаткаПоГрафику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОстаткаПоГрафикуВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРНП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратАвтоБУ</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратАвтоНУ</name>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратБУ</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратНУ</name>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.абс_ВидыДеятельностиКТТК</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДС</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьВБалансе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатратАвто</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаРПРБУ</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаРПРНУ</name>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС_РПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаПоДоговору</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьАванс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппаАвто</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДеятельностиАвто</name>
      <type>
        <types>CatalogRef.абс_ВидыДеятельностиКТТК</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСАвансаПоДоговору</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСАвансаПоДоговору</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ttk_ПериодВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТипСети</name>
      <type>
        <types>CatalogRef.абс_ТипыСетей</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_КВ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТЭО</name>
      <type>
        <types>CatalogRef.абс_ТЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>ttk_ОбъектБюджетирования</name>
      <type>
        <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ttk_Город</name>
      <type>
        <types>CatalogRef.ttk_Города</types>
      </type>
    </attributes>
    <attributes>
      <name>ttk_Инициатор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Reports/абс_ОтчетПоДокументуРПР/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	абс_РезервыПроизведенныхРасходовРезервы.Контрагент,
	|	абс_РезервыПроизведенныхРасходовРезервы.ДоговорКонтрагента,
	|	абс_РезервыПроизведенныхРасходовРезервы.ЗакупочныйЗаказ,
	|	абс_РезервыПроизведенныхРасходовРезервы.БюджетнаяСтатья,
	|	абс_РезервыПроизведенныхРасходовРезервы.ЦФУ,
	|	СУММА(абс_РезервыПроизведенныхРасходовРезервы.СуммаОстаткаПоГрафику) КАК СуммаОстаткаПоГрафику,
	|	СУММА(абс_РезервыПроизведенныхРасходовРезервы.СуммаРНП) КАК СуммаРНП,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратАвтоБУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратАвтоНУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратБУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратНУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.СтатьяЗатрат,
	|	абс_РезервыПроизведенныхРасходовРезервы.НоменклатурнаяГруппа,
	|	абс_РезервыПроизведенныхРасходовРезервы.ВидДеятельности,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетУчетаНДС,
	|	СУММА(абс_РезервыПроизведенныхРасходовРезервы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(абс_РезервыПроизведенныхРасходовРезервы.СуммаНДС_РПР) КАК СуммаНДС_РПР,
	|	СУММА(абс_РезервыПроизведенныхРасходовРезервы.СуммаРНП + абс_РезервыПроизведенныхРасходовРезервы.СуммаНДС_РПР) КАК СуммаВсего
	|{ВЫБРАТЬ
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	ЗакупочныйЗаказ.*,
	|	БюджетнаяСтатья.*,
	|	ЦФУ.*,
	|	СчетЗатратАвтоБУ.*,
	|	СчетЗатратАвтоНУ.*,
	|	СчетЗатратБУ.*,
	|	СчетЗатратНУ.*,
	|	СтатьяЗатрат.*,
	|	НоменклатурнаяГруппа.*,
	|	ВидДеятельности.*,
	|	СчетУчетаНДС.*,
	|	СуммаОстаткаПоГрафику,
	|	СуммаРНП,
	|	СуммаНДС,
	|	СуммаНДС_РПР,
	|	СуммаВсего}
	|ИЗ
	|	Документ.абс_РезервыПроизведенныхРасходов.Резервы КАК абс_РезервыПроизведенныхРасходовРезервы
	|ГДЕ
	|	абс_РезервыПроизведенныхРасходовРезервы.Учитывать
	|	И абс_РезервыПроизведенныхРасходовРезервы.Ссылка = &Ссылка
	|{ГДЕ
	|	абс_РезервыПроизведенныхРасходовРезервы.Контрагент.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.ДоговорКонтрагента.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.ЗакупочныйЗаказ.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.БюджетнаяСтатья.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.ЦФУ.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.СуммаОстаткаПоГрафику,
	|	абс_РезервыПроизведенныхРасходовРезервы.СуммаРНП,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратАвтоБУ.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратАвтоНУ.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратБУ.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратНУ.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.СтатьяЗатрат.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.НоменклатурнаяГруппа.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.ВидДеятельности.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетУчетаНДС.*,
	|	абс_РезервыПроизведенныхРасходовРезервы.СуммаНДС,
	|	абс_РезервыПроизведенныхРасходовРезервы.СуммаНДС_РПР,
	|	(абс_РезервыПроизведенныхРасходовРезервы.СуммаРНП + абс_РезервыПроизведенныхРасходовРезервы.СуммаНДС_РПР) КАК СуммаВсего}
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_РезервыПроизведенныхРасходовРезервы.ЦФУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.ДоговорКонтрагента,
	|	абс_РезервыПроизведенныхРасходовРезервы.ЗакупочныйЗаказ,
	|	абс_РезервыПроизведенныхРасходовРезервы.БюджетнаяСтатья,
	|	абс_РезервыПроизведенныхРасходовРезервы.Контрагент,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратАвтоНУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.ВидДеятельности,
	|	абс_РезервыПроизведенныхРасходовРезервы.СтатьяЗатрат,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратАвтоБУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратБУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетЗатратНУ,
	|	абс_РезервыПроизведенныхРасходовРезервы.СчетУчетаНДС,
	|	абс_РезервыПроизведенныхРасходовРезервы.НоменклатурнаяГруппа
	|{УПОРЯДОЧИТЬ ПО
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	ЗакупочныйЗаказ.*,
	|	БюджетнаяСтатья.*,
	|	ЦФУ.*,
	|	СуммаОстаткаПоГрафику,
	|	СуммаРНП,
	|	СчетЗатратАвтоБУ.*,
	|	СчетЗатратАвтоНУ.*,
	|	СчетЗатратБУ.*,
	|	СчетЗатратНУ.*,
	|	СтатьяЗатрат.*,
	|	НоменклатурнаяГруппа.*,
	|	ВидДеятельности.*,
	|	СчетУчетаНДС.*,
	|	СуммаНДС,
	|	СуммаНДС_РПР,
	|	СуммаВсего}
	|{ИТОГИ ПО
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	ЗакупочныйЗаказ.*,
	|	БюджетнаяСтатья.*,
	|	ЦФУ.*,
	|	СуммаОстаткаПоГрафику,
	|	СуммаРНП,
	|	СчетЗатратАвтоБУ.*,
	|	СчетЗатратАвтоНУ.*,
	|	СчетЗатратБУ.*,
	|	СчетЗатратНУ.*,
	|	СтатьяЗатрат.*,
	|	НоменклатурнаяГруппа.*,
	|	ВидДеятельности.*,
	|	СчетУчетаНДС.*,
	|	СуммаНДС,
	|	СуммаНДС_РПР,
	|	СуммаВсего}";
	
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	// Покупатель
	// ДоговорКонтрагента
	ВалютаРегл = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент", "Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента", "Договор контрагента");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЗакупочныйЗаказ", "Закупочный заказ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("БюджетнаяСтатья", "Бюджетная статья");
    УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦФУ", "ЦФУ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаОстаткаПоГрафику", "Сумма по проекту (руб.)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРНП", "Сумма резерва (без НДС)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СчетЗатратАвтоБУ", "Счет авто БУ");
    УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СчетЗатратАвтоНУ", "Счет авто НУ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СчетЗатратБУ", "Счет БУ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СчетЗатратНУ", "Счет НУ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", "Статья затрат");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатурнаяГруппа", "Номенклатурная группа");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВидДеятельности", "Вид деятельности");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СчетУчетаНДС", "Счет учета НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаНДС", "Сумма НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаНДС_РПР", "Сумма НДС УН");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаВсего", "Сумма УН (с НДС)");
	
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.    
	
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета");
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
		
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаОстаткаПоГрафику", "Сумма по графику (руб.)", Истина, "ЧЦ=15; ЧДЦ=2");	
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРНП", "Сумма резерва (без НДС)", Истина, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаНДС", "Сумма НДС", Истина, "ЧЦ=15; ЧДЦ=2");	
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаНДС_РПР", "Сумма НДС резерва", Истина, "ЧЦ=15; ЧДЦ=2");	
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаВсего", "Сумма резерва (с НДС)", Истина, "ЧЦ=15; ЧДЦ=2");

	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("БюджетнаяСтатья");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ЗакупочныйЗаказ");

	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	//УниверсальныйОтчет.ДобавитьОтбор("Организация");
	//УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	//УниверсальныйОтчет.ДобавитьОтбор("Поставщик");
	//УниверсальныйОтчет.ДобавитьОтбор("Покупатель");
	//УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
	//УниверсальныйОтчет.РасширеннаяНастройка = Истина;
	//
	//УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	//
	//УниверсальныйОтчет.ДобавитьДополнительноеПоле("Контрагент"					, ТипРазмещенияРеквизитовИзмерений.Отдельно);
	//УниверсальныйОтчет.ДобавитьДополнительноеПоле("Контрагент.Код"				, ТипРазмещенияРеквизитовИзмерений.Отдельно);
	//УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДоговорКонтрагента"			, ТипРазмещенияРеквизитовИзмерений.Отдельно);
	//УниверсальныйОтчет.ДобавитьДополнительноеПоле("ДоговорКонтрагента.Код"		, ТипРазмещенияРеквизитовИзмерений.Отдельно);
	//УниверсальныйОтчет.ДобавитьДополнительноеПоле("Счет"						, ТипРазмещенияРеквизитовИзмерений.Отдельно);
		
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Ссылка", ДокументРПР);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	Возврат "";
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

УниверсальныйОтчет.мРежимВводаПериода = 1;

мСчета60 = Новый Массив;

мСчета60.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01"));
мСчета60.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.02"));
мСчета60.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.21"));
мСчета60.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.22"));
мСчета60.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.31"));
мСчета60.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.32"));

#КонецЕсли
